#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/holistic-shield/gh-actions-holistic-shield-website-dev/runs/run-sMBEfGUPygis4Cmr

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
module.website.data.aws_acm_certificate.holistic_shield: Reading...
module.website.aws_s3_bucket.bucket: Refreshing state... [id=www.dev.holisticshield.com]
module.website.aws_s3_bucket_website_configuration.configuration: Refreshing state... [id=www.dev.holisticshield.com]
module.website.aws_s3_bucket_ownership_controls.ownership: Refreshing state... [id=www.dev.holisticshield.com]
module.website.aws_s3_bucket_public_access_block.access: Refreshing state... [id=www.dev.holisticshield.com]
module.website.data.aws_iam_policy_document.policy: Reading...
module.website.data.aws_iam_policy_document.policy: Read complete after 0s [id=1760900526]
module.website.data.aws_acm_certificate.holistic_shield: Read complete after 0s [id=arn:aws:acm:us-east-1:476300006968:certificate/f3874601-afb4-4f5c-b4a1-48707da4daef]
module.website.aws_cloudfront_distribution.distribution: Refreshing state... [id=E13PXF6AWLGCIX]
module.website.aws_s3_bucket_acl.acl: Refreshing state... [id=www.dev.holisticshield.com,public-read]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.website.aws_iam_role.website_public will be created
  + resource "aws_iam_role" "website_public" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = [
                          + "arn:aws:s3:::www.dev.holisticshield.com/*",
                          + "arn:aws:s3:::www.dev.holisticshield.com",
                        ]
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-holistic-shield-website-public"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Env"   = "dev"
          + "Name"  = "Holistic Shield"
          + "Owner" = "Thageesan Thanabalasingam"
          + "Role"  = "holistic-shield"
        }
      + tags_all              = {
          + "Env"   = "dev"
          + "Name"  = "Holistic Shield"
          + "Owner" = "Thageesan Thanabalasingam"
          + "Role"  = "holistic-shield"
        }
      + unique_id             = (known after apply)
    }

  # module.website.aws_s3_bucket_policy.bucket_policy will be created
  + resource "aws_s3_bucket_policy" "bucket_policy" {
      + bucket = "www.dev.holisticshield.com"
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = [
                          + "arn:aws:s3:::www.dev.holisticshield.com/*",
                          + "arn:aws:s3:::www.dev.holisticshield.com",
                        ]
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

Plan: 2 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @thageesan, Action: `pull_request`*